///// DB에 저장이 되는 항목인 경우 CMB_CONST_XXXXX 의 형태로 CONST를 붙임.

CMB_RCS_CRACK_CONDITION_DRY                   = "Dry"
CMB_RCS_CRACK_CONDITION_ETC                   = "Etc"

CMB_RCS_CRACK_CONDITION_MILD                  = "Mild or Moderate"
CMB_RCS_CRACK_CONDITION_MODERATE              = "Severe"

CMB_RCS_SOIL_LOAD_TYPE_SOIL                   = "by Soil Property"
CMB_RCS_SOIL_LOAD_TYPE_USER                   = "by User"

CMB_RCS_BAR_SPLICE_TYPE_000                   = "Do not splice"
CMB_RCS_BAR_SPLICE_TYPE_050                   = "50% Splice"
CMB_RCS_BAR_SPLICE_TYPE_100                   = "100% Splice"

CMB_RCS_BEAM_BAR_TYPE_ALL_SECT                = "Type-1 ( All Section )"
CMB_RCS_BEAM_BAR_TYPE_BOTH_END                = "Type-2 ( Both End & Center )"
CMB_RCS_BEAM_BAR_TYPE_EACH_END                = "Type-3 ( Each End & Center )"

CMB_SLAB_SUPPORT_TYPE_1WAY                    = "1 Way"
CMB_SLAB_SUPPORT_TYPE_2WAY                    = "2 Way"
CMB_SLAB_REBAR_TYPE_A                         = "Type-A"
CMB_SLAB_REBAR_TYPE_B                         = "Type-B"
CMB_SLAB_REBAR_TYPE_C                         = "Type-C"

CMB_URBE_BARTYPE_SINGLE                       = "Single"
CMB_URBE_BARTYPE_DOUBLE                       = "Double"
CMB_URBE_SHAPE_TYPE_RECT                      = "Rect"
CMB_URBE_SHAPE_TYPE_TEE                       = "T"
CMB_URBE_SKINBAR_POSITION_TENS                = "T-Zone"
CMB_URBE_SKINBAR_POSITION_SIDE                = "SIDE"
CMB_URBE_ARRANGE_TYPE_1                       = "Type-1"
CMB_URBE_ARRANGE_TYPE_2                       = "Type-2"
CMB_URBE_ARRANGE_TYPE_3                       = "Type-3"

CMB_URCO_SHAPE_RECT                           = "Rectangle"
CMB_URCO_SHAPE_CIRC                           = "Circle"
CMB_URCO_SHAPE_PIPE                           = "Pipe"

CMB_URDW_PARREL_DIR_XDIR                      = "X-Dir"
CMB_URDW_PARREL_DIR_YDIR                      = "Y-Dir"
CMB_URDW_PARREL_DIR_USER                      = "User Input"
CMB_URDW_EFFECT_AREA_DIR_X                    = "X-Dir"
CMB_URDW_EFFECT_AREA_DIR_Y                    = "Y-Dir"
CMB_URDW_REBAR_ARR_EQUALLY                    = "Distribute Equally"
CMB_URDW_REBAR_ARR_SPACE_END                  = "Exact Space - End"
CMB_URDW_REBAR_ARR_SPACE_MID                  = "Exact Space - Mid"
CMB_URDW_FLANGE_WIDTH_TYPE_ACTUAL             = "Actual"
CMB_URDW_FLANGE_WIDTH_TYPE_EFFECT             = "Effective"

CMB_UFDN_FOOT_TYPE_ISOL_MAT                   = "Isolated ( Mat )"
CMB_UFDN_FOOT_TYPE_ISOL_PIL                   = "Isolated ( Pile )"
CMB_UFDN_FOOT_TYPE_LINE_MAT                   = "Line/Wall ( Mat )"

CMB_URRW_WALL_TYPE_T                          = "T"
CMB_URRW_WALL_TYPE_L                          = "L"
CMB_URRW_DISP_TYPE_SECT_ONLY                  = "Section Only"
CMB_URRW_DISP_TYPE_RBAR_ONLY                  = "Rebar Only"
CMB_URRW_DISP_TYPE_SECT_RBAR                  = "Section + Rebar"
CMB_URRW_DISP_TYPE_SELF_WGHT                  = "Self Weight"
CMB_URRW_DISP_TYPE_PRSS_SERV                  = "Soil Pressure ( Service Load )"
CMB_URRW_DISP_TYPE_PRSS_FACT                  = "Soil Pressure ( Factored Load )"
CMB_URRW_DISP_TYPE_BEAR_SERV                  = "Bearing Diagram ( Service Load )"
CMB_URRW_DISP_TYPE_BEAR_SLID                  = "Bearing Diagram ( Service Load, Sliding )"
CMB_URRW_DISP_TYPE_BEAR_FACT                  = "Bearing Diagram ( Factored Load )"
CMB_URRW_DISP_TYPE_BEAR_SKEY                  = "Bearing Diagram ( Factored Load, Shear Key )"

CMB_URAB_DISP_TYPE_TOTAL                      = "Plan & Elevation"
CMB_URAB_DISP_TYPE_PLAN                       = "Plan"
CMB_URAB_DISP_TYPE_ELEV_X                     = "Elevation ( x )"
CMB_URAB_DISP_TYPE_ELEV_Y                     = "Elevation ( y )"
CMB_URAB_SECT_CRACK                     	  = "Crack"
CMB_URAB_SECT_UNCRACK                         = "Uncrack"

CMB_ERCF_SECT_SHAPE_INVT                      = "Inverted T"
CMB_ERCF_SECT_SHAPE_RECT                      = "Rectangle"
CMB_ERCF_SECT_SHAPE_ANGL                      = "Angle(L)"
CMB_URCF_REBAR_POS_CANTI_L                    = "Cantilever ( L )"
CMB_URCF_REBAR_POS_CANTI_R                    = "Cantilever ( R )"
CMB_URCF_REBAR_POS_SUPP                       = "Support ( %d )"
CMB_URCF_REBAR_POS_SPAN                       = "Span ( %d - %d )"
CMB_URCF_REBAR_GRID_TOP                       = "Top"
CMB_URCF_REBAR_GRID_BOT                       = "Bottom"
CMB_URCF_DISP_TYPE_PLAN_SECT                  = "Plan & Section"
CMB_URCF_DISP_TYPE_DIAGRAM_M                  = "Bending Moment Diagram"
CMB_URCF_DISP_TYPE_DIAGRAM_V                  = "Shear Force Diagram"

CMB_URBW_SUPPORT_TYPE_1WAY                    = "1 Way"
CMB_URBW_SUPPORT_TYPE_2WAY                    = "2 Way"
CMB_URBW_DISP_TYPE_SECTION_RBAR               = "Section & Rebar Pattern"
CMB_URBW_DISP_TYPE_SOILMAP_COMM               = "Soil Map + Pressure"
CMB_URBW_DISP_TYPE_SOILMAP_STAT               = "Soil Map + Pressure ( Static )"
CMB_URBW_DISP_TYPE_SOILMAP_SEIS               = "Soil Map + Pressure ( Seismic )"
CMB_URBW_DISP_TYPE_SOILMAP_COMB               = "Soil Map + Pressure ( Static + Seismic )"
CMB_URBW_DISP_TYPE_DIAG_COMM_MX               = "Bending Moment Diagram ( Mxx )"
CMB_URBW_DISP_TYPE_DIAG_COMM_MY               = "Bending Moment Diagram ( Myy )"
CMB_URBW_DISP_TYPE_DIAG_STAT_MX               = "Bending Moment Diagram ( Mxx, Static )"
CMB_URBW_DISP_TYPE_DIAG_STAT_MY               = "Bending Moment Diagram ( Myy, Static )"
CMB_URBW_DISP_TYPE_DIAG_SEIS_MX               = "Bending Moment Diagram ( Mxx, Seismic )"
CMB_URBW_DISP_TYPE_DIAG_SEIS_MY               = "Bending Moment Diagram ( Myy, Seismic )"
CMB_URBW_DISP_TYPE_DIAG_COMB_MX               = "Bending Moment Diagram ( Mxx, Static + Seismic )"
CMB_URBW_DISP_TYPE_DIAG_COMB_MY               = "Bending Moment Diagram ( Myy, Static + Seismic )"
CMB_URBW_DISP_TYPE_DIAG_COMM_VX               = "Shear Force Diagram ( Vxx )"
CMB_URBW_DISP_TYPE_DIAG_COMM_VY               = "Shear Force Diagram ( Vyy )"
CMB_URBW_DISP_TYPE_DIAG_STAT_VX               = "Shear Force Diagram ( Vxx, Static )"
CMB_URBW_DISP_TYPE_DIAG_STAT_VY               = "Shear Force Diagram ( Vyy, Static )"
CMB_URBW_DISP_TYPE_DIAG_SEIS_VX               = "Shear Force Diagram ( Vxx, Seismic )"
CMB_URBW_DISP_TYPE_DIAG_SEIS_VY               = "Shear Force Diagram ( Vyy, Seismic )"
CMB_URBW_DISP_TYPE_DIAG_COMB_VX               = "Shear Force Diagram ( Vxx, Static + Seismic )"
CMB_URBW_DISP_TYPE_DIAG_COMB_VY               = "Shear Force Diagram ( Vyy, Static + Seismic )"

CMB_URBU_DISP_TYPE_SECTION_RBAR               = "Section"
CMB_URBU_DISP_TYPE_SOILMAP_COMM               = "Soil Map + Pressure"
CMB_URBU_DISP_TYPE_SOILMAP_STAT               = "Soil Map + Pressure ( Static )"
CMB_URBU_DISP_TYPE_SOILMAP_SEIS               = "Soil Map + Pressure ( Seismic )"
CMB_URBU_DISP_TYPE_SOILMAP_COMB               = "Soil Map + Pressure ( Static + Seismic )"
CMB_URBU_DISP_TYPE_DIAG_COMM_MU               = "Bending Moment Diagram"
CMB_URBU_DISP_TYPE_DIAG_STAT_MU               = "Bending Moment Diagram ( Static )"
CMB_URBU_DISP_TYPE_DIAG_SEIS_MU               = "Bending Moment Diagram ( Seismic )"
CMB_URBU_DISP_TYPE_DIAG_COMB_MU               = "Bending Moment Diagram ( Static + Seismic )"
CMB_URBU_DISP_TYPE_DIAG_COMM_VU               = "Shear Force Diagram"
CMB_URBU_DISP_TYPE_DIAG_STAT_VU               = "Shear Force Diagram ( Static )"
CMB_URBU_DISP_TYPE_DIAG_SEIS_VU               = "Shear Force Diagram ( Seismic )"
CMB_URBU_DISP_TYPE_DIAG_COMB_VU               = "Shear Force Diagram ( Static + Seismic )"

CMB_URST_DISP_TYPE_PLAN_SECT                  = "Plan + Section"
CMB_URST_DISP_TYPE_DIAGRAM_M                  = "Bending Moment Diagram"
CMB_URST_DISP_TYPE_DIAGRAM_V                  = "Shear Force Diagram"
CMB_URST_SUPPORT_BY_OTHER                     = "by Others"
CMB_URST_SUPPORT_BY_LNDNG                     = "by Landing"

CMB_URSF_SHAPE_RECT                           = "Rectangle"
CMB_URSF_SHAPE_INVT                           = "Inverted T"

CMB_URBL_COMPBAR_TYPE_NONE                    = "Do not consider"
CMB_URBL_COMPBAR_TYPE_LAYR                    = "All of layer 1"
CMB_URBL_COMPBAR_TYPE_RATO                    = "By Ratio"

CMB_URGW_WALL_DGN_METHOD_1                    = "Method-1"
CMB_URGW_WALL_DGN_METHOD_2                    = "Method-2"
CMB_URGW_WALL_DGN_METHOD_3                    = "Method-3"
CMB_URGW_WALL_DGN_METHOD_4                    = "Method-4"

CMB_URAB_LAYOUT_TYPE_GRID                     = "Grid Type"
CMB_URAB_LAYOUT_TYPE_COLM                     = "Column Type"
CMB_URAB_LAYOUT_TYPE_CIRC                     = "Circle Type"
CMB_URAB_LAYOUT_TYPE_GNRL                     = "General Type"

CMB_ERCF_DISP_TYPE_PLAN_SECT                  = "Plan + Section"
CMB_ERCF_DISP_TYPE_PLAN_ONLY                  = "Plan"
CMB_ERCF_DISP_TYPE_SECT_ONLY                  = "Section"
CMB_ERCF_DISP_TYPE_SOIL_SERV                  = "Soil Diagram ( Service Load )"
CMB_ERCF_DISP_TYPE_SOIL_FACT                  = "Soil Diagram ( Factored Load )"
CMB_ERCF_DISP_TYPE_DIAG_BMDX                  = "Bending Moment Diagram"
CMB_ERCF_DISP_TYPE_DIAG_SFDX                  = "Shear Force Diagram"

CMB_RCS_MBAR_RHO_MIN                          = "Minimum Ratio ( rhoMin )"
CMB_RCS_MBAR_RHO_MAX                          = "Maximum Ratio ( rhoMax )"
CMB_RCS_MBAR_RHO_AVG                          = "( rhoMin + rhoMax ) / 2"
CMB_RCS_MBAR_RHO_USER                         = "User Defined"
